{"message":null,"num_results":1,"products":[{"url":"http://www.productwiki.com/nikon-coolpix-s3000/","id":36043,"title":"Nikon Coolpix S3000","description":"<p>The <strong>Coolpix S3000</strong> is the new generation S series announced by Nikon on February 3rd 2010 along with the <a href=\"http://www.productwiki.com/nikon-coolpix-s4000/\">Coolpix S4000</a>. This is the successor to the <a href=\"http://www.productwiki.com/nikon-coolpix-s220/\">S220</a>, offering enhanced shooting functions, 12 mega-pixel resolution and a choice of seven colors. The monitor on the back is a 2.7&quot; 230k-dot TFT LCD with anti-reflection coating and the internal memory is 47MB via the included SD card. Along with the S4000, it shares the same wide-angle 4x optical zoom NIKKOR lens, as well as an optimized image processing system based on Nikon's EXPEED technology for capturing highly detailed images. Other advanced digital features common to both are subject tracking, where the camera detects and follows the subject even if it moves, keeping it in focus at all times, and, smart portrait mode with smile timer, blink proofing, red-eye fix, skin softening etc. Other features have been implemented to reduce blur caused by camera or subject movement such as Nikon&rsquo;s original BSS (Best Shot Selector) function which automatically shoots up to 10 frames and saves the one with the sharpest focus. Scene auto-selector mode makes switching between shooting conditions fast and simple. Available in black, champagne silver, red, blue, orange, magenta and purple.</p>\n<h2>Features</h2>\n<ul>\n    <li>Effective pixels: 12.0 million</li>\n    <li>Lens: 4x zoom NIKKOR; 4.9-19.6mm (35mm [135] format picture angle: 27-108mm); f/3.2-5.9; Digital zoom: up to 4x (35mm [135] format picture angle: 432mm)</li>\n    <li>Focus range (from lens):  Approx. 50 cm (1 ft. 8 in.) to infinity (&infin;), Macro close-up mode: Approx. 8 cm (3.2 in.) to infinity (&infin;)</li>\n    <li>Monitor: 2.7-in., approx. 230k-dot, TFT LCD with anti-reflection coating</li>\n    <li>Storage media: Internal memory (approx. 47 MB), SD memory cards</li>\n    <li>ISO sensitivity: ISO 80, 100, 200, 400, 800, 1600, 3200, Auto (auto gain ISO 80-1600), Fixed range auto (ISO 80-400, 80-800)</li>\n    <li>Interface: Hi-Speed USB</li>\n    <li>Power sources: Rechargeable Li-ion Battery EN-EL10 (supplied), Charging AC Adapter EH-68P/EH-68P (AR) (supplied), AC Adapter EH-62D (optional), Battery Charger MH-63 (optional)</li>\n    <li>Battery life: Approx. 220 shots with EN-EL10 battery</li>\n    <li>Dimensions (WxHxD): Approx. 94.3 x 55.9 x 19.0 mm (3.8 x 2.2 x 0.8 in.) excluding projections</li>\n    <li>Weight: Approx. 116 g (4.1 oz.) with battery and SD memory card</li>\n    <li>Supplied accessories: Rechargeable Li-ion Battery EN-EL10, Charging AC Adapter EH-68P/EH-68P (AR), USB Cable UC-E6, Audio Video Cable EG-CP14, Strap AN-CP19, Software Suite CD-ROM</li>\n</ul>","proscore":"67","number_of_reviews":"1","category":"Digital Cameras","key_features":[],"images":[],"proscons":{"pros":[{"text":"menus are very intuitive, no instruction manual required","id":"66662","score":"1","submitter":false},{"text":"design has visual appeal, small, solid and shiny","id":"66664","score":"1","submitter":false},{"text":"simple operation, basic point-and-shoot with scene modes","id":"66666","score":"1","submitter":false},{"text":"indoor shots with flash are sharp and clear","id":"66667","score":"1","submitter":false},{"text":"gathers both shadow and hilight details in sunny environments","id":"66668","score":"1","submitter":false},{"text":"images stabilization works very effectively","id":"66669","score":"1","submitter":false}],"cons":[{"text":"no paper manual included other than a \"quick start guide\"","id":"66663","score":"1","submitter":false},{"text":"no direct control over camera settings, scene modes only","id":"66665","score":"1","submitter":false},{"text":"shutter button is a little loose","id":"66670","score":"1","submitter":false}]},"reviews":[],"tags":[],"competitors":[],"related":[{"url":"http://www.productwiki.com/nikon-coolpix-l110/","id":36694,"title":"Nikon Coolpix L110","description":"<p>The <strong>Coolpix L110</strong> is part of Nikon's L, or 'Life' series of digital cameras, it is an entry level camera nestled right below Nikon's S series. This model has a resolution of 12.1 megapixels and is available in black or red. It comes with a 3&quot; 460k-dot TFT LCD display on the back with anti-reflection coating and has a 15x optical zoom NIKKOR lens capable of shooting a broad range of focal lengths with 35mm format equivalent angles of view from 28mm up to 420mm. HD video recording with stereo sound is supported and the camera can be connected to a tv via the HDMI port for viewing in high quality. Actually up to 7 hours of video or 840 still images can be recorded when using the four included AA Energizer Ultimate Lithium batteries. The L110 comes with other built-in features such as electronic vibration reduction, motion detection, auto-focus, red-eye reduction, face recognition and support for sensitivities up to ISO 6400.</p>\n<h2>Features</h2>\n<ul>\n    <li>Effective pixels: 12.1 million</li>\n    <li>Lens: 15x zoom NIKKOR; 5.0-75.0mm (35mm [135] format picture angle: 28-420mm); f/3.5-5.4; Digital zoom: up to 4x (35mm [135] format picture angle: 1680mm)</li>\n    <li>Focus range (from lens):&nbsp; 50cm (1 ft. 8 in.) to infinity (&infin;); Macro mode: 1cm (0.4 in.) to infinity (&infin;)</li>\n    <li>Monitor: 3-in., approx. 460k-dot, TFT LCD with anti-reflection coating</li>\n    <li>Storage media: Internal memory (approx. 43 MB), SD memory cards</li>\n    <li>ISO sensitivity: ISO 80, 100, 200, 400, 800, 1600, 3200*2, 6400*2, Auto (auto gain ISO 80-800)</li>\n    <li>Interface: Hi-Speed USB</li>\n    <li>Power sources: Four FR6/L91 (AA-size) lithium batteries (supplied), four LR6/L40 (AA-size) alkaline batteries (optional), four EN-MH2 rechargeable Ni-MH batteries (optional), AC Adapter EH-67 (optional)</li>\n    <li>Battery life: Approx. 840 shots with lithium, or 270 shots with alkaline, or 500 shots with EN-MH2 battery</li>\n    <li>Dimensions (WxHxD): Approx. 108.9 x 74.3 x 78.1 mm (4.3 x 3.0 x 3.1 in.) excluding projections</li>\n    <li>Weight: Approx. 406 g (14.4 oz.) with battery and SD memory card</li>\n    <li>Supplied accessories: Four FR6/L91 (AA-size) lithium batteries, USB Cable UC-E6, Audio Video Cable EG-CP14, Strap AN-CP21, Lens Cap LC-CP20, Software Suite CD-ROM</li>\n</ul>","proscore":"81","number_of_reviews":"9","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"Records 720p HD video with stereo audio","id":null,"score":null,"submitter":false},{"text":"15x NIKKOR Zoom lens with vibration reduction","id":null,"score":null,"submitter":false},{"text":"HDMI output for direct playback of video and images onto a compatible HDTV / display","id":null,"score":null,"submitter":false},{"text":"pop-up flash","id":null,"score":null,"submitter":false},{"text":"3.0\" display with higher than average resolution (460k dot)","id":null,"score":null,"submitter":false},{"text":"great value - better than average specifications at a low price","id":null,"score":null,"submitter":false},{"text":"affordable price point","id":null,"score":null,"submitter":false},{"text":"2GB of free web image hosting on Picturetown","id":null,"score":null,"submitter":false},{"text":"runs on AA batteries - universal and easy to find, great for if you're out and about and forgot to bring spares","id":null,"score":null,"submitter":false}],"cons":[{"text":"not aesthetically pleasing compared to smaller, sleeker P&S offerings","id":null,"score":null,"submitter":false},{"text":"runs on AA batteries, as opposed to higher capacity rechargeable lithium-ion battery packs","id":null,"score":null,"submitter":false},{"text":"larger size - not pocketable","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/nikon-coolpix-l22/","id":36703,"title":"Nikon Coolpix L22","description":"<p>The <strong>Coolpix L22</strong> is part of Nikon's 'Life&quot; series of digital cameras, it is an&nbsp;entry level camera offering a 3.6 zoom NIKKOR lens with vibration reduction, 12.0 megapixel resolution and large 3&quot; 230k-dot&nbsp; TFT LCD display on the back. EXPEED image processing engine is employed as well as smart portrait mode and easy auto mode which lets the camera automatically select the optimum scene mode. A USB port is included for easy file transfer as well as an SD card slot, power is supplied by two rechargeable AA batteries or the optional AC adapter(which is alternately used to charge the batteries).&nbsp; Available in blue, champagne silver, black and red.</p>\n<h2>Features</h2>\n<ul>\n    <li>Effective pixels: 12.0 million</li>\n    <li>Lens: 3.6x zoom NIKKOR; 6.7-24.0mm (35mm [135] format picture angle: 37-134mm); f/3.1-6.7; Digital zoom: up to 4x (35mm [135] format picture angle: 536mm)</li>\n    <li>Focus range (from lens):&nbsp; Approx. 30cm (1 ft.) to infinity (&infin;); Macro close-up mode: Approx. 5cm (2 in.) to infinity (&infin;)</li>\n    <li>Monitor: 3-in., approx. 230k-dot, TFT LCD</li>\n    <li>Storage media: Internal memory (approx. 19 MB), SD memory cards</li>\n    <li>ISO sensitivity: Auto (auto gain ISO 80-1600)</li>\n    <li>Interface: Hi-Speed USB</li>\n    <li>Power sources: Two LR6/L40 (AA-size) alkaline batteries (supplied), two FR6/L91 (AA-size) lithium batteries (optional), two EN-MH2 rechargeable Ni-MH batteries (optional), AC Adapter EH-65A (optional)</li>\n    <li>Battery life: Approx. 240 shots with alkaline, 660 shots with lithium, or 420 shots with EN-MH2 battery</li>\n    <li>Dimensions (WxHxD): Approx. 97.7 x 60.5 x 28.3 mm (3.9 x 2.4 x 1.2 in.) excluding projections</li>\n    <li>Weight: Approx. Approx. 183 g (6.5 oz.) with battery and SD memory card</li>\n    <li>Supplied accessories: Two LR6/L40 (AA-size) alkaline batteries, USB Cable UC-E6, Audio Video Cable EG-CP14, Strap AN-CP19, Software Suite CD-ROM</li>\n</ul>","proscore":"75","number_of_reviews":"2","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"'Easy Auto' mode automatically selects the best scene setting ","id":null,"score":null,"submitter":false},{"text":"Smart portrait mode with blink warning/red-eye fix","id":null,"score":null,"submitter":false},{"text":"3.6x zoom NIKKOR lense with vibration reduction/12.0 megapixels","id":null,"score":null,"submitter":false}],"cons":[{"text":"images are distorted most of the times due to vibration such as in bad light condition","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/nikon-coolpix-s4000/","id":36082,"title":"Nikon Coolpix S4000","description":"<p>The <strong>Nikon Coolpix S4000</strong> is the successor to the Coolpix <a href=\"http://www.productwiki.com/nikon-coolpix-s230/\">S230</a>, announced by Nikon in February 2010 along with another new S series model, the <a href=\"http://www.productwiki.com/nikon-coolpix-s3000/\">Coolpix S3000</a>. Both come in a choice of colors(7 colors for the S3000 and 5 for this one), and support SD cards as well as USB. This model however offers a 3&quot; 460k-dot TFT LCD touch-screen replete with stylus for drawing pictures on frames as well as editing and paint function, and there is also the ability to record HD video with sound to AVI file. Another feature that makes good use of the touch-screen is a 'touch' shutter which lets you touch the monitor where you would like the camera to focus and it is done automatically. Like the entry level S3000, it has 12 mege-pixel resolution and a wide-angle 4x optical zoom NIKKOR lens, as well as a host of enhanced shooting features like subject tracking, smart portrait mode with smile timer, red-eye fix, blink proofing, skin softening and more. It also comes with an internal 45MB SD card which can be removed or files can be backed up to computer via the USB connection. Available in bronze, black, pink, gloss champagne and plum.</p>\n<h2>Features</h2>\n<ul>\n    <li>Effective pixels: 12.0 million</li>\n    <li>Lens: 4x zoom NIKKOR; 4.9-19.6mm (35mm [135] format picture angle: 27-108mm); f/3.2-5.9; Digital zoom: up to 4x (35mm [135] format picture angle: 432mm)</li>\n    <li>Focus range (from lens): Approx. 50 cm (1 ft. 8 in.) to infinity (&infin;), Macro close-up mode: Approx. 8 cm (3.2 in.) to infinity (&infin;)</li>\n    <li>Monitor: 3-in., approx. 460k-dot, TFT LCD with touch screen control and anti-reflection coating</li>\n    <li>Storage media: Internal memory (approx. 45 MB), SD memory cards</li>\n    <li>ISO sensitivity: ISO 80, 100, 200, 400, 800, 1600, 3200, Auto (auto gain ISO 80-1600), Fixed range auto (ISO 80-400, 80-800)</li>\n    <li>Interface: Hi-Speed USB</li>\n    <li>Power sources: Rechargeable Li-ion Battery EN-EL10 (supplied), Charging AC Adapter EH-68P/EH-68P (AR) (supplied), AC Adapter EH-62D (optional), Battery Charger MH-63 (optional)</li>\n    <li>Battery life: Approx. 190 shots with EN-EL10 battery</li>\n    <li>Dimensions (WxHxD): Approx. 94.5 x 56.5 x 20.4 mm (3.8 x 2.3 x 0.8 in.) excluding projections</li>\n    <li>Weight: Approx. 131 g (4.7 oz.) with battery and SD memory card</li>\n    <li>Supplied accessories: Rechargeable Li-ion Battery EN-EL10, Charging AC Adapter EH-68P/EH-68P (AR), USB Cable UC-E6, Audio Video Cable EG-CP14, Strap AN-CP19, Stylus, Software Suite CD-ROM</li>\n</ul>","proscore":"57","number_of_reviews":"1","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"small enough to easily fit in a shirt or pants pocket","id":null,"score":null,"submitter":false},{"text":"battery lasts a very long time between charges","id":null,"score":null,"submitter":false},{"text":"touchscreen is easy to work with, seems large when being used despite its actual size","id":null,"score":null,"submitter":false},{"text":"start up and shut down is very fast","id":null,"score":null,"submitter":false}],"cons":[{"text":"does not include HDMI output","id":null,"score":null,"submitter":false},{"text":"deleting an individual photo results in a long pause before it completes","id":null,"score":null,"submitter":false},{"text":"long pause between button press and shutter release","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/nikon-coolpix-s6000/","id":36489,"title":"Nikon Coolpix S6000","description":"<p>The <strong>Nikon Coolpix S6000</strong> was announced on February 3rd 2010 for release in the following month along with the <a href=\"http://www.productwiki.com/nikon-coolpix-s8000/\">Coolpix S8000</a>. These cameras are touted as the the thinnest cameras in their respective classes, with the S8000 having 10x zoom and a larger monitor and this model offering 7x zoom and a high-speed power up time of .75 seconds and shooting time lag of .3 seconds. Both share the same NIKKOR high-powered zoom lens type, USB port, internal 32MB SD card and are both capable of taking up to 210 shots on one charge when using the included Li-ion battery. Also included is an AC adapter which may also be used to power the device as well as the battery. The rear monitor is a 2.7&quot; 230k-dot, wide-viewing angle TFT LCD with anti-reflection coating and the photo lens is capable of wide-angle 28mm through telephoto 196mm (both 35mm format equivalent). Nikon has also incorporated many digital functions such as motion detection, subject tracking, smart portait system with skin softening and a four way lens-shift vibration or VR reduction function. 720p HD video recording at 30fps is also supported, and can be played back via the HDMI output.</p>\n<h2>Features</h2>\n<ul>\n    <li>Effective pixels: 14.2 million</li>\n    <li>Lens: 7x zoom NIKKOR; 5.0-35.0mm (equivalent with 35mm [135] format picture angle: 28-196mm); f/3.7-5.6; Digital zoom: up to 2x (35mm [135] format picture angle: 392mm)</li>\n    <li>Focus range (from lens): Approx. 50 cm (1 ft. 8 in.) to infinity (&infin;), Macro close-up mode: Approx. 3 cm (1.2 in.) to infinity (&infin;)</li>\n    <li>Monitor: 2.7-in., approx. 230k-dot, TFT LCD with anti-reflection coating</li>\n    <li>Storage media: Internal memory, 32 MB SD memory card</li>\n    <li>ISO sensitivity: ISO 100, 200, 400, 800, 1600, 3200, Auto (auto gain ISO 100-1600), Fixed range auto (ISO 100-400, 100-800)</li>\n    <li>Interface: Hi-Speed USB</li>\n    <li>Power sources: Rechargeable Li-ion Battery EN-EL12 (supplied), Charging AC Adapter EH-68P/EH-68P (AR) (supplied), AC Adapter EH-62F (optional), Battery Charger MH-65 (optional)</li>\n    <li>Battery life: Approx. 210 shots with EN-EL12 battery</li>\n    <li>Dimensions (WxHxD): Approx. 97.0 x 55.5 x 25.0 mm (3.9 x 2.2 x 1.0 in.) excluding projections</li>\n    <li>Weight: Approx. 156 g (5.5 oz.) with battery and SD memory card</li>\n    <li>Supplied accessories: Rechargeable Li-ion Battery EN-EL12, Charging AC Adapter EH-68P/EH-68P (AR), USB Cable UC-E6, Audio Video Cable EG-CP14, Strap AN-CP19, Software Suite CD-ROM</li>\n</ul>","proscore":"67","number_of_reviews":"1","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"Uses SD/SDHC cards","id":null,"score":null,"submitter":false},{"text":"7x Optical Zoom","id":null,"score":null,"submitter":false},{"text":"Records in 720P HD Video","id":null,"score":null,"submitter":false},{"text":"Easy to find in bundle for $200 that comes with 2gb card and case.","id":null,"score":null,"submitter":false}],"cons":[{"text":"Cheep feel, mostly plastic compared to other Nikon point and shoots.","id":null,"score":null,"submitter":false},{"text":"Does not come with battery charger.  Must charge battery through camera.","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/nikon-coolpix-s8000/","id":36651,"title":"Nikon Coolpix S8000","description":"<p>The <strong>Nikon Coolpix S8000</strong> is part of the new line of S series digital cameras that will be released in March 2010 along with the <a href=\"http://www.productwiki.com/nikon-coolpix-s6000/\">Coolpix S6000</a>, both of which are labeled as the thinnest in their respective classes. This model sports a 3&quot;, 921k-dot TFT LCD on the back with Clear Color Display and wide viewing angle as well as a NIKKOR ED wide-angle 10x zoom glass lens that covers a broad focal range from wide-angle 30mm to super-telephoto 300mm with a resolution of 14.2 megapixels. Along with the NIKKOR lens, it also shares features with the S6000 including USB port, internal 32MB SD card and both cameras can take up to 210 shots on one charge when using the included Li-ion battery.</p>\n<p>An AC adapter is included which can be used to charge the battery and power the camera as well. HD video recording at 720p 30fps is also supported, and can be played back via the HDMI output. Some new features on these cameras include VR or vibration reduction for image stabilization, motion detection, advanced flash control and a new image processing engine which enables improved picture quality in images captured at ISO 1600 with automatic ISO sensitivity adjustment and high ISO 3200 capability at any image size up to the maximum of 4320 x 3240 pixels. Available in black, red, champagne silver and bronze.</p>\n<h2>Features</h2>\n<ul>\n    <li>Effective pixels: 14.2 million</li>\n    <li>Lens: 10x zoom NIKKOR; 5.4-54.0mm (equivalent with 35mm [135] format picture angle: 30-300mm); f/3.5-5.6; Digital zoom: up to 2x (35mm [135] format picture angle: 600mm)</li>\n    <li>Focus range (from lens): Approx. 50 cm (1 ft. 8 in.) to infinity (&infin;), Macro close-up mode: Approx. 1 cm (0.4 in.) to infinity (&infin;)</li>\n    <li>Monitor: 3-in., approx. 921k-dot, wide-viewing angle TFT LCD with anti-reflection coating</li>\n    <li>Storage media: Internal memory, 32 MB SD memory card</li>\n    <li>ISO sensitivity: ISO 100, 200, 400, 800, 1600, 3200, Auto (auto gain ISO 100-1600), Fixed range auto (ISO 100-400, 100-800)</li>\n    <li>Interface: Hi-Speed USB</li>\n    <li>Power sources: Rechargeable Li-ion Battery EN-EL12 (supplied), Charging AC Adapter EH-68P/EH-68P (AR) (supplied), AC Adapter EH-62F (optional), Battery Charger MH-65 (optional)</li>\n    <li>Battery life: Approx. 210 shots with EN-EL12 battery</li>\n    <li>Dimensions (WxHxD): Approx. 103.0 x 57.0 x 27.3 mm (4.1 x 2.3 x 1.1 in.) excluding projections</li>\n    <li>Weight: Approx. 183 g (6.5 oz.) with battery and SD memory card</li>\n    <li>Supplied accessories: Rechargeable Li-ion Battery EN-EL12, Charging AC Adapter EH-68P/EH-68P (AR), USB Cable UC-E6, Audio Video Cable EG-CP14, Strap AN-CP19, Software Suite CD-ROM</li>\n</ul>","proscore":"84","number_of_reviews":"1","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"records video in 720p high definition with stereo sound","id":null,"score":null,"submitter":false},{"text":"wide-angle 10x optical zoom","id":null,"score":null,"submitter":false},{"text":"large high resolution 3\" display (921k pixel)","id":null,"score":null,"submitter":false},{"text":"pop-up flash","id":null,"score":null,"submitter":false},{"text":"basic in-camera image adjustments - make slight adjustments without the use of a PC","id":null,"score":null,"submitter":false},{"text":"best shot selector - takes 10 images in quick succession and picks the sharpest result","id":null,"score":null,"submitter":false},{"text":"somewhat affordable price for a premium camera","id":null,"score":null,"submitter":false},{"text":"lens-shift image stabilization","id":null,"score":null,"submitter":false},{"text":"2GB of free online picture storage with Picturetown","id":null,"score":null,"submitter":false},{"text":"HDMI output for displaying images and video directly on any capable HDTV / display","id":null,"score":null,"submitter":false},{"text":"very slim","id":null,"score":null,"submitter":false},{"text":"quality materials / build","id":null,"score":null,"submitter":false},{"text":"compact and lightweight","id":null,"score":null,"submitter":false},{"text":"can be charged and downloaded from via a standard USB connection","id":null,"score":null,"submitter":false},{"text":"takes affordable, easy to find, and capacious SD/SDHC flash storage cards","id":null,"score":null,"submitter":false},{"text":"very fast auto-focus","id":null,"score":null,"submitter":false}],"cons":[{"text":"misleading claims of fast start-up, takes at least 4 seconds","id":null,"score":null,"submitter":false},{"text":"not compatible with the latest SDXC standard","id":null,"score":null,"submitter":false},{"text":"3FPS continuous shooting requires reduction of image resolution to 3MP - full resolution continuous shooting is sub-par","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null}],"skus":[{"title":"Nikon Coolpix S3000 | Purple","upc":"018208262113","mpn":"S3000Plum","asin":"B0034XDT0S","ean":"079767493660"},{"title":"Nikon Coolpix S3000 | Orange","upc":"018208262106","mpn":"S3000Orange","asin":"B0034XMI00","ean":"018208262106"},{"title":"Nikon Coolpix S3000 | Black","upc":"018208262076","mpn":"S3000Black","asin":"B0034XKDN4","ean":"001820826207"},{"title":"Nikon Coolpix S3000 | Blue","upc":"018208262090","mpn":"S3000Blue","asin":"B0034XGLIK","ean":"018208262090"},{"title":"Nikon Coolpix S3000 | Green","upc":"018208262083","mpn":"S3000Green","asin":"B0036ORZCI","ean":"018208262083"},{"title":"Nikon Coolpix S3000 | Silver","upc":"018208262069","mpn":"S3000ChampagneSilver","asin":"B0034XGLV2","ean":"018208262069"}]}]}