{"message":null,"num_results":1,"products":[{"url":"http://www.productwiki.com/samsung-wf431abp/","id":85549,"title":"Samsung WF431ABP","description":"<p>The&nbsp;Samsung WF431ABP is a mid-range to high-end front-load washer with Energy Star certification. It features Samsung's exclusive PowerFoam technology,&nbsp;Vibration Reduction Technology and PureCycle self cleaning. Additionally, the&nbsp;WF431ABP sports a 3.9 cu. ft. wash drum, 13 wash cycles with 7 options and a 24-hour start delay function.</p>\n<p>The&nbsp;WF431ABP's PowerFoam technology creates a gentle but deep-cleaning foam during the wash cycle which penetrates fabrics deeply and up to 40 times faster than regular detergent. Its&nbsp;Vibration Reduction Technology allows the&nbsp;WF431ABP to operate much less quietly with smoother operation at higher spin speeds&nbsp;while improving the handling of unbalanced loads. Meanwhile, the&nbsp;WF431ABP's&nbsp;PureCycle technology uses&nbsp;high speed spinning and hot water to effectively clean the drum of detergent residue and dirt. The&nbsp;Samsung WF431ABP is available in Stainless Platinum Electric and Neat White Electric.</p>\n<h2>Features</h2>\n<ul>\n    <li>Energy Star certified</li>\n    <li>3.9 cu. ft. wash drum</li>\n    <li>PowerFoam technology</li>\n    <li>Vibration Reduction Technology</li>\n    <li>PureCycle self cleaning</li>\n    <li>13 wash cycles with 7 options</li>\n    <li>24-hour start delay function</li>\n    <li>Available in Stainless Platinum Electric and Neat White Electric</li>\n</ul>","proscore":"0","number_of_reviews":"1","category":"Front Load Washers","key_features":[],"images":[],"proscons":null,"reviews":[],"tags":[],"competitors":[],"related":[{"url":"http://www.productwiki.com/samsung-wf511abw/","id":85548,"title":"Samsung WF511ABW","description":"<p>The&nbsp;Samsung WF511ABW is a mid-range to high-end front-load washer similar to the&nbsp;<a href=\"http://www.productwiki.com/samsung-wf431abp/\">Samsung&nbsp;WF431ABP</a>. The sole difference between the two washers is that the&nbsp;WF511ABW sports a larger 4.3 cu. ft. wash drum (as opposed to the&nbsp;WF431ABP's 3.9 cu. ft.). Otherwise, the two washer sport the same basic features, including&nbsp;PowerFoam technology,&nbsp;Vibration Reduction Technology and a Steam Cycle.</p>\n<p>The&nbsp;WF511ABW's&nbsp;PowerFoam technology turns&nbsp;HE detergent into a powerful, yet gentle, cleaning foam which can better penetrate fabrics than traditional detergents. Its&nbsp;Vibration Reduction Technology allows the&nbsp;WF511ABW to be installed on upper floors of houses or in apartments with less worry of loud, disruptive wash cycles as faster drum movement is significantly smoothed out. Meanwhile, the&nbsp;WF511ABW's&nbsp;Steam Cycle allows it to eliminate most stains without the need for pretreatment.</p>\n<h2>Features&nbsp;</h2>\n<ul>\n    <li>Energy Star certified</li>\n    <li>4.3 cu. ft. wash drum</li>\n    <li>PowerFoam technology</li>\n    <li>Vibration Reduction Technology</li>\n    <li>PureCycle self cleaning</li>\n    <li>13 wash cycles with 7 options</li>\n    <li>24-hour start delay function</li>\n    <li>Available in Stainless Platinum Electric and Neat White Electric</li>\n</ul>","proscore":"-1","number_of_reviews":"0","category":null,"key_features":[],"images":[],"proscons":null,"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null}],"skus":[{"title":"Samsung WF431ABP","upc":"036725569195","mpn":"WF431ABP","asin":"B004RV2CK4","ean":"036725569195"}]}]}