{"message":null,"num_results":1,"products":[{"url":"http://www.productwiki.com/samsung-wf330anw/","id":46723,"title":"Samsung WF330ANW","description":"<p>The&nbsp;Samsung WF330ANW is a high-end front-loading washer similar to the&nbsp;<a href=\"http://www.productwiki.com/samsung-wf220anw/\">Samsung WF220ANW</a>. The&nbsp;WF330ANW boasts a number of improvements over the&nbsp;WF220ANW, namely one more wash cycle (totaling 9), steam cleaning, Diamond Drum design and a larger capacity (4.3 cu. ft. as opposed to 4). Otherwise, the two washers sport very similar specs and features including a self-cleaning cycle.</p>\n<p>The&nbsp;WF330ANW's steam cleaning technology allows users to add a steam cycle to 7 of the&nbsp;WF330ANW's 9 wash cycles for added cleaning power. Its Diamond Drum design features a diamond studded drum interior which has been specifically designed to reduce wear on clothing. Additionally, the&nbsp;WF330ANW's PureCycle self-cleaning mode utilizes hot water to clean the&nbsp;WF330ANW's drum, lengthening its lifespan as no harsh chemicals are used that might degrade it.</p>\n<h2>Features</h2>\n<ul>\n    <li>4.3 cu. ft. capacity</li>\n    <li>Steam Clean technology</li>\n    <li>Diamond Drum design</li>\n    <li>Bleach, detergent and fabric softener dispensers</li>\n    <li>PureCycle self-cleaning option</li>\n    <li>19 Hour Delay Start Timer</li>\n    <li>Vibration Reduction Technology</li>\n    <li>9 Wash Cycles</li>\n    <li>3 Wash Cycle Options</li>\n    <li>1 Year warranty, parts and labour</li>\n</ul>\n<h2>Colour Options</h2>\n<ul>\n    <li><a href=\"http://www.samsung.com/us/appliances/washers-dryers/WF330ANB/XAA\">Samsung WF330ANB</a> - Breakwater Blue - $899</li>\n</ul>","proscore":"86","number_of_reviews":"1","category":"Front Load Washers","key_features":[],"images":[],"proscons":{"pros":[{"text":"pleasant sounding chime at the end of the cycle","id":"68519","score":"1","submitter":false},{"text":"controls are intuitive and simple to learn","id":"68520","score":"1","submitter":false},{"text":"good warning system for when water hoses are crimped and other general maintenance issues","id":"68522","score":"1","submitter":false},{"text":"water usage is very conservative","id":"68523","score":"1","submitter":false},{"text":"runs almost silently, can hear it a bit when doing the spin cycle but isn't ever very loud","id":"68524","score":"1","submitter":false},{"text":"no snags or tangles, everything stays loose","id":"68528","score":"1","submitter":false}],"cons":[{"text":"panel design is intimidating to look at when first starting out, new users have to be willing to just try it out","id":"68521","score":"0","submitter":false}]},"reviews":[],"tags":[],"competitors":[],"related":[{"url":"http://www.productwiki.com/samsung-wf210anw/","id":46721,"title":"Samsung WF210ANW","description":"<p>The&nbsp;Samsung WF210ANW is a high-end front-loading washer with a 4 cu. ft. capacity. It features three dispenser trays for bleach, detergent and fabric softener as well as a 19 Hour Delay Start Timer for added convenience. Additionally, the&nbsp;WF210ANW sports&nbsp;Vibration Reduction Technology which allows it to be installed on the upper floors of a home.</p>\n<p>The&nbsp;WF210ANW's dispenser trays allow users to add the detergent, fabric softener and bleach at the beginning of the wash as each element gets introduced to the load at just the right moment. Its&nbsp;19 Hour Delay Start Timer allows users to set the&nbsp;WF210ANW to start at any point up to 19 hours into the future, allowing loads to be ready as soon as you wake up or get home from work. Meanwhile, the&nbsp;WF210ANW's&nbsp;Vibration Reduction Technology ensures smooth, quiet performance even at 1300 rotations per minute, making installation on upper floors a valid option.</p>\n<h2>Features</h2>\n<ul>\n    <li>4 cu. ft. capacity</li>\n    <li>Bleach, detergent and fabric softener dispensers</li>\n    <li>19 Hour Delay Start Timer</li>\n    <li>Vibration Reduction Technology</li>\n    <li>6 Wash Cycles</li>\n    <li>3 Wash Cycle Options</li>\n    <li>1 Year warranty, parts and labour</li>\n</ul>","proscore":"86","number_of_reviews":"1","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"Quiet operation compared to other front-load washers","id":null,"score":null,"submitter":false},{"text":"Highly efficient spin cycle means less required dryer time, resulting in energy savings","id":null,"score":null,"submitter":false},{"text":"Settings and operation are straight-forward and easy to learn","id":null,"score":null,"submitter":false},{"text":"Uses extremely little water compared to other front- or top-load washers","id":null,"score":null,"submitter":false},{"text":"Cleans clothes very effectively without wearing them out as much as some washers","id":null,"score":null,"submitter":false},{"text":"Large door opening adds to ease of use","id":null,"score":null,"submitter":false}],"cons":[{"text":"Some loads take slightly longer to clean than in top-load washers","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/samsung-wf220anw/","id":46722,"title":"Samsung WF220ANW","description":"<p>The&nbsp;Samsung WF220ANW is a high-end front loading washer similar to the&nbsp;<a href=\"http://www.productwiki.com/samsung-wf210anw/\">Samsung WF210ANW</a>. The&nbsp;WF220ANW boasts two major improvements over the&nbsp;WF210ANW, namely a self-cleaning cycle and more wash cycles (8 as opposed to the&nbsp;WF210ANW's 6). Otherwise, the two washers sport similar features and specs, including a 4 cu. ft. capacity, a&nbsp;19 Hour Delay Start Timer&nbsp;and&nbsp;Vibration Reduction Technology.</p>\n<p>The&nbsp;WF220ANW's PureCycle self-cleaning option uses only very hot water rather than harsh chemicals to remove dirt and eliminate bacteria, lengthening the life of the drum. Its&nbsp;19 Hour Delay Start Timer allows users to set the&nbsp;WF220ANW to start at a set point in the near future, allowing laundry to be ready just as you're coming home from work. Additionally, the&nbsp;WF220ANW's&nbsp;Vibration Reduction Technology ensures smooth, quiet performance while in use, allowing the&nbsp;WF220ANW to be placed on the upper floors of a house without worry.</p>\n<h2>Features</h2>\n<p>&nbsp;</p>\n<ul>\n    <li>4 cu. ft. capacity</li>\n    <li>Bleach, detergent and fabric softener dispensers</li>\n    <li>PureCycle self-cleaning option</li>\n    <li>19 Hour Delay Start Timer</li>\n    <li>Vibration Reduction Technology</li>\n    <li>8 Wash Cycles</li>\n    <li>3 Wash Cycle Options</li>\n    <li>1 Year warranty, parts and labour</li>\n</ul>\n<p>&nbsp;</p>","proscore":"71","number_of_reviews":"1","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"runs very quietly, even during the spin cycle you can talk in a normal voice while standing next to it","id":null,"score":null,"submitter":false},{"text":"bright digital clock shows number of minutes left in the cycle, can see it from across the room","id":null,"score":null,"submitter":false},{"text":"water and electricity use are very low, energy efficient","id":null,"score":null,"submitter":false},{"text":"door is wide and easy to work with - lots of room to put things in and pull them out","id":null,"score":null,"submitter":false},{"text":"coins and other objects are collected in an easily accessible area","id":null,"score":null,"submitter":false}],"cons":[{"text":"tune played at the end of the cycle isn't very loud, won't hear it unless you're in the same room","id":null,"score":null,"submitter":false},{"text":"need to read the instructions to operate it properly, seems overwhelming at first","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/samsung-wf350anw/","id":46724,"title":"Samsung WF350ANW","description":"<p>The&nbsp;Samsung WF350ANW is a high-end front loading washer similar to the&nbsp;<a href=\"http://www.productwiki.com/samsung-wf330anw/\">Samsung WF330ANW</a>. The sole improvement that the&nbsp;WF350ANW boasts over the&nbsp;WF330ANW is its expanded wash cycles (11 as opposed to the&nbsp;WF330ANW's 9) including a Deep Steam cycle. Otherwise, the two washers sport very similar features, including a Diamond Drum design and a self cleaning cycle.</p>\n<p>The&nbsp;WF350ANW's Deep Steam cycle applies high-powered steam to clothing, eliminating the need for pre-treating as fresh stains and dirt are loosened by the pressured steam. Its Diamond Drum design features an inner drum design that is studded with diamond-shaped bumps designed to reduce wear on clothing. Additionally, the&nbsp;WF350ANW's PureCycle self cleaning option is not only convenient, it lengthens the life of the drum as only hot water is used to clean it.</p>\n<h2>Features</h2>\n<p>\n<ul>\n    <li>4.3 cu. ft. capacity</li>\n    <li>Steam Clean technology</li>\n    <li>Diamond Drum design</li>\n    <li>Bleach, detergent and fabric softener dispensers</li>\n    <li>PureCycle self-cleaning option</li>\n    <li>Deep Steam cycle</li>\n    <li>Vibration Reduction Technology</li>\n    <li>11 Wash Cycles</li>\n    <li>3 Wash Cycle Options</li>\n    <li>1 Year warranty, parts and labour</li>\n</ul>\n<h2>Colour Options</h2>\n<ul>\n    <li><a href=\"http://www.samsung.com/us/appliances/washers-dryers/WF350ANR/XAA\">Samsung&nbsp;WF350ANR</a> - Tango Red - $999</li>\n</ul>\n</p>","proscore":"57","number_of_reviews":"1","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"runs very quietly, won't usually hear it in the next room","id":null,"score":null,"submitter":false},{"text":"offers plenty of control over how the wash cycle runs","id":null,"score":null,"submitter":false},{"text":"dispensers work reliably, never miss a cycle once you've set them","id":null,"score":null,"submitter":false},{"text":"clothes come out clean and fresh, especially with the steam functions","id":null,"score":null,"submitter":false}],"cons":[{"text":"mold can tend to form in the detergent dispenser","id":null,"score":null,"submitter":false},{"text":"mold buildup can accumulate on the outside edge of the drum","id":null,"score":null,"submitter":false},{"text":"will shake at the beginning of the spin cycle until it self-adjusts","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/samsung-wf520abp/","id":46720,"title":"Samsung WF520ABP","description":"<p>The&nbsp;Samsung WF520ABP is a top-of-the-line front loading washer similar to the&nbsp;<a href=\"http://www.productwiki.com/samsung-wf350anw/\">Samsung WF350ANW</a>. The main improvements that the&nbsp;WF520ABP boasts over the&nbsp;WF350ANW are an extended 5 cu. ft. capacity (the&nbsp;WF350ANW's capacity is 4.3 cu. ft.), a Stainless Platinum Exterior, 13 wash cycles (as opposed to the&nbsp;WF350ANW's 11), 6 wash cycle options (as opposed to 3) and PowerFoam technology. Otherwise, the two washers sport the same specs and features, including Steam Clean options and Vibration Reduction Technology.</p>\n<p>The&nbsp;WF520ABP's PowerFoam technology utilizes a mix of detergent, water and air at the beginning of each cycle to create a deep-cleansing foam which ensures a better spread when foamed for a greater overall clean. Its Steam Clean ability can be added to 7 of the&nbsp;WF520ABP's 13 wash cycles for a greater clean and quick stain removal. Meanwhile, the&nbsp;WF520ABP's&nbsp;Vibration Reduction Technology ensures quiet, smooth operation even at maximum speeds, allowing it to be used on the upper floors of a home.</p>\n<h2>Features</h2>\n<p>\n<ul>\n    <li>5 cu. ft. capacity</li>\n    <li>Stainless Platinum Exterior</li>\n    <li>Steam Clean technology</li>\n    <li>Diamond Drum design</li>\n    <li>PowerFoam technology</li>\n    <li>Bleach, detergent and fabric softener dispensers</li>\n    <li>PureCycle self-cleaning option</li>\n    <li>Vibration Reduction Technology</li>\n    <li>13 Wash Cycles</li>\n    <li>6 Wash Cycle Options</li>\n    <li>1 Year warranty, parts and labour</li>\n</ul>\n</p>","proscore":"86","number_of_reviews":"1","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"good door design, easy to load and unload","id":null,"score":null,"submitter":false},{"text":"digital display is easy to read, text is sharp and well backlit","id":null,"score":null,"submitter":false},{"text":"doesn't start smelling musty like some other front-loaders","id":null,"score":null,"submitter":false},{"text":"lots of cycle types and options available, easy to find something perfect","id":null,"score":null,"submitter":false},{"text":"Steam Clean cycle effectively eliminates odors","id":null,"score":null,"submitter":false},{"text":"good stability, easy to get it balanced right","id":null,"score":null,"submitter":false}],"cons":[{"text":"PowerFoam functionality doesn't actually wash clothes as well in cold as in warm, as claimed","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null}],"skus":[{"title":"Samsung WF330ANW","upc":"036725578142","mpn":"WF330ANW","asin":"B003MNEPYE","ean":"036725578142"}]}]}