{"message":null,"num_results":1,"products":[{"url":"http://www.productwiki.com/lg-wm2450hra/","id":85547,"title":"LG WM2450HRA","description":"<p>The&nbsp;LG WM2450HRA is a low-end to mid-range front-load washer with Energy Star certification. It features a 3.7 cu. ft. drum,&nbsp;TrueSteam technology,&nbsp;ColdWash technology and a&nbsp;Direct Drive Motor. Additionally, the&nbsp;WM2450HRA sports an&nbsp;Allergiene cycle, 6Motion wash technology, TrueBalance anti-vibration technology and a SpeedWash cycle for smaller, less dirty loads.</p>\n<p>The&nbsp;WM2450HRA's&nbsp;TrueSteam technology utilizes a real steam generator which produces hotter and smaller particles of steam than washers with less ideal steam solutions into fabrics for a gentle, powerful clean. Its&nbsp;ColdWash technology allows the&nbsp;WM2450HRA to provide a more effective cold wash clean by way of enhanced drum motions. Meanwhile, the&nbsp;WM2450HRA's&nbsp;Direct Drive Motor ensures greater durability and consistency as it contains fewer moving parts than typical washer motors for greater efficiency.</p>\n<h2>Features</h2>\n<ul>\n    <li>3.7 cu. ft. drum</li>\n    <li>TrueSteam technology</li>\n    <li>ColdWash technology</li>\n    <li>Direct Drive Motor</li>\n    <li>Allergiene cycle</li>\n    <li>6Motion wash technology</li>\n    <li>TrueBalance anti-vibration technology</li>\n    <li>SpeedWash cycle</li>\n    <li>Warranty:&nbsp;1 Year Parts and Labor, 10 Years Motor, Lifetime on Drum</li>\n    <li>Energy Star certified</li>\n</ul>","proscore":"78","number_of_reviews":"3","category":"Front Load Washers","key_features":[],"images":[],"proscons":{"pros":[{"text":"Reasonably priced for the size and features.","id":"106621","score":"3","submitter":false},{"text":"Sleek visual aesthetic with an attractive red finish.","id":"106622","score":"1","submitter":false},{"text":"SpeedWash cycle is great for small, quick loads.","id":"106623","score":"1","submitter":false},{"text":"Excellent warranty coverage (1 Year Parts and Labor, 10 Years Motor, Lifetime on Drum).","id":"106624","score":"1","submitter":false},{"text":"Allergiene cycle is pretty effective at eliminating allergens.","id":"106625","score":"1","submitter":false}],"cons":[{"text":"Not as energy efficient as comparable washers in this class.","id":"106626","score":"1","submitter":false},{"text":"TrueSteam technology works pretty well but some pretreating is still required to get rid of some stains.","id":"106627","score":"0","submitter":false}]},"reviews":[],"tags":[],"competitors":[],"related":[],"skus":[{"title":"LG WM2450HRA","upc":"048231012201","mpn":"WM2450HRA","asin":"B00563VF32","ean":"048231012201"}]}]}