{"message":null,"num_results":1,"products":[{"url":"http://www.productwiki.com/garmin-nuvi-50lm/","id":86560,"title":"Garmin nuvi 50LM","description":"<p>The Nuvi 50LM is an automotive GPS unit from Garmin that offers a step-up from the company's standard Nuvi 50 model. Available with US-only and full North American (US &amp; Canada) map data, this model includes lifetime updates to ensure users are consistently provided with the most accurate and up-to-date information. Available up to 4 times a year, owners can log onto the Garmin website and update their device firmware via USB connectivity. This process also keeps track of over 8 million points of interest (POIs) that may be encountered along a given travel route, including gas stations, restaurants and entertainment locations. Turn-by-turn directions are displayed on the Nuvi's 5-inch touchscreen LCD display, which offers quick configuration of destination addresses and intuitive control of detouring and re-routing on the fly. The Junction View and Lane Assist functions help to increase navigational accuracy when nearing a capital city or other major metropolitan area, providing users with a simulated 3D view of their surrounds complete with off-ramps and exit signs. Under the instruction of virtual areas and spoken-word commands, drivers can complete lane changes in confidence with minimal confusion.&nbsp;</p>\n<h2>Features</h2>\n<ul>\n    <li>5-inch full-color LCD touchscreen</li>\n    <li>Free lifetime map updates&nbsp;</li>\n    <li>Available in two different mapping versions - US only or US and Canada</li>\n    <li>&quot;Where Am I&quot; emergency locator function&nbsp;</li>\n    <li>Includes over 6-million POIs&nbsp;</li>\n    <li>Spoken street names&nbsp;</li>\n    <li>Lane Assist with Junction View&nbsp;</li>\n    <li>Bult-in speed limit indicator</li>\n</ul>\n<p>&nbsp;</p>","proscore":"86","number_of_reviews":"2","category":"Automobile GPS Units","key_features":[],"images":[],"proscons":{"pros":[{"text":"Accurate maps with an easy to use interface","id":"151607","score":"1","submitter":false},{"text":"Multiple language selection on both interface text and voice direction","id":"151625","score":"1","submitter":false},{"text":"Excellent price point when you consider all the features ","id":"151638","score":"1","submitter":false},{"text":"www.seomoz.org/beginners-guide-to-seo/basics-of-search-engine-friendly-design-and-development","id":"156108","score":"1","submitter":false},{"text":"The audio is crisp and clear- It has plenty of volume capacity even when your air is on","id":"151602","score":"0","submitter":false},{"text":"Very easy to upload map updates ","id":"151640","score":"-1","submitter":false}],"cons":[{"text":"Traffic alert doesn't really help that much since it's not that reliable ","id":"151616","score":"1","submitter":false}]},"reviews":[],"tags":[],"competitors":[],"related":[],"skus":[{"title":"Garmin nüvi 50LM 5-inch Portable GPS Navigator(US)","upc":"753759978945","mpn":"010-00991-21","asin":"B0057OCDQS","ean":"753759978945"},{"title":"Garmin nüvi 50LM (US and Canada)","upc":"753759978938","mpn":"010-00991-20","asin":"B005HSDL8S","ean":"753759978938"}]}]}