{"message":null,"num_results":1,"products":[{"url":"http://www.productwiki.com/skullcandy-g-i/","id":22081,"title":"Skullcandy G.I.","description":"<p>The <strong>Skullcandy G.I.</strong> model is a mid-grade headphone set designed with a heavyweight and durable structure to ensure the headset will hold up even during the most rigorous conditions possible. The fully adjustable headband ensures a firm fit for users of all ages and the headset would prove useful for both casual in home, and travel use. The <span style=\"font-weight: bold;\">G.I.</span> model headphone set is equipped with a pair of large size 40mm diameter driver units for enhanced sound. The <strong>Skullcandy G.I.</strong> headphones include additional features such as a 1.2M cord with a 3.5mm gold plated stereo plug for maximum conductivity, a 6.3mm plug adapter, interchangeable ear-pads, and a travel bag. The headphone set is also available in various different color patterns such as Desert-Camo, Green-Core, Grey-Core, Rasta, Red-Core and Winter-Camo.</p>\n<h2>Features</h2>\n<ul>\n    <li>Over the head headband design with Closed/rest on ear speaker design</li>\n    <li>Fully adjustable headband</li>\n    <li>6.3mm adapter, interchangeable ear-pads and a travel bag included</li>\n    <li>1.2M cord with a 3.5mm gold plated stereo plug</li>\n    <li>Available in many different colors; Desert-Camo, Green-Core, Grey-Core, Rasta, Red-Core and Winter-Camo</li>\n    <li>Driver Unit Diameter: 40mm</li>\n    <li>Frequency range: 100 &ndash; 18,000 Hz</li>\n    <li>Impedance: 50 ohms</li>\n    <li>Max input power: 400mW</li>\n</ul>","proscore":"50","number_of_reviews":"3","category":"Misc Headphones","key_features":[],"images":[],"proscons":{"pros":[{"text":"Durable, flexible, loud, comfortable, good sound quality, good bass","id":"23298","score":"1","submitter":false}],"cons":[{"text":"leak sound a lot, vibrate at bass intensive spots in songs, big to carry","id":"23299","score":"1","submitter":false},{"text":"cracks within 4 months laser cut aliminium ...not next time im buying senheiser","id":"44224","score":"1","submitter":false}]},"reviews":[],"tags":[],"competitors":[],"related":[{"url":"http://www.productwiki.com/skullcandy-double-agent/","id":22050,"title":"Skullcandy Double Agent","description":"<p>The <strong>Skullcandy Double Agent</strong> model is a high end headphone set designed with a closed-ear body and ear port structure. It is targeted for users of all ages who are constantly on the go, but it can also be used casually for home and business. Skullcandy claims the <strong>Double Agent</strong> headphones present a &quot;hegemonic threat to headphones as we know them&quot;. The <strong>Double Agent</strong> headphones include large size 40mm diameter driver units, designed specifically to give crystal clear highs and booming lows. The headphones also feature a very innovative, built-in SD card slot; which allows users to directly play music on the headset eliminating the dependency on multiple media devices. The <strong>Double Agent</strong> headphone set includes additional features such as a fully detachable 1 meter USB cable, a fully detachable 1.5 meter standard 3.5mm stereo cable, an included Lithium Ion battery with a maximum of 8 hours run time after a 1.5 hour charge, and the headset is available in various color options.</p>\n<h2>Features</h2>\n<ul>\n    <li>Closed-ear ear port structure</li>\n    <li>Built-in SD card slot; with full support for MP3 file playback</li>\n    <li>Fully detachable USB cable (1M)</li>\n    <li>Fully detachable 3.5mm stereo cable (1.5M)</li>\n    <li>Lithium Ion battery included; 8 hour maximum run time after 1.5 hour charge</li>\n    <li>Available in several different colors; Black, Brown and Green</li>\n    <li>Driver Unit Diameter: 40mm</li>\n    <li>Frequency range: 18 -20,000 Hz</li>\n    <li>Impedance: 32 ohms</li>\n</ul>","proscore":"75","number_of_reviews":"2","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"Great for on the go","id":null,"score":null,"submitter":false},{"text":"Extremely comftorable","id":null,"score":null,"submitter":false},{"text":"Comes with a micro SD card","id":null,"score":null,"submitter":false}],"cons":[{"text":"Not the best Frequency response for the price [18 -20,000 Hz]","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/skullcandy-hesh/","id":22084,"title":"Skullcandy Hesh","description":"<p>The <strong>Skullcandy Hesh</strong> model is a mid-grade headphone set designed with a thick, yet portable structure for use during many different occasions; it is suitable for casual in home/business and travel use. The fully adjustable headband ensures a firm fit for users of all ages. The <span style=\"font-weight: bold;\">Hesh</span> model headphone set is equipped with a pair of very large size 50mm diameter driver units for enhanced bass; Skullcandy claims the headphones deliver a &quot;roar like a sea monster whupping Batman's butt&quot;. The <strong>Skullcandy Hesh</strong> headphones include additional features such as a 1.2M cord with a 3.5mm gold plated stereo plug for maximum conductivity, a travel bag, and a maximum power input of 100mW. The headphone set is also available in various different color sets such as Black-Green, Black, Black-Red, Black-White and Striped.</p>\n<h2>Features</h2>\n<ul>\n    <li>Over the head headband design with Closed/rest on ear speaker design</li>\n    <li>Fully adjustable headband</li>\n    <li>Includes a travel bag</li>\n    <li>1.2M cord with a 3.5mm gold plated stereo plug</li>\n    <li>Available in many different colors; Black-Green, Black, Black-Red, Black-White and Striped</li>\n    <li>Driver Unit Diameter: 50mm</li>\n    <li>Frequency range: 100 &ndash; 18,000 Hz</li>\n    <li>Impedance: 32 ohms</li>\n    <li>Max input power: 100mW</li>\n</ul>\n<p>&nbsp;</p>","proscore":"50","number_of_reviews":"2","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"Sufficient bass frequency presence considering price point","id":null,"score":null,"submitter":false},{"text":"Built-in driver unit ensures sufficient volume capabilities in virtually any setting","id":null,"score":null,"submitter":false},{"text":"Wide variety of color schemes are visually striking and appeal to many types of listeners","id":null,"score":null,"submitter":false},{"text":"Warranty ensures 50% - 100% percent discount on a replacement pair depending on damage type","id":null,"score":null,"submitter":false}],"cons":[{"text":"Lack of metal reinforcement increases likelihood of snapping or cracking with regular use","id":null,"score":null,"submitter":false},{"text":"Residual sound can be problematic when listening in public spaces","id":null,"score":null,"submitter":false},{"text":"Headband curve can apply excessive pressure to the user's head regardless of vertical adjustment ","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/skullcandy-icon/","id":22067,"title":"Skullcandy iCon","description":"<p>The <strong>Skullcandy iCon</strong> model is a low end sports headphone set designed with a lightweight structure for use during travel and on-the-go occasions. The <strong>iCon</strong> model is directly related to the <strong>Skullcandy Recruit</strong> headphone model and is nearly identical. The specially designed and custom built double headband ensures a firm fit for users of all ages. The <strong>iCon</strong> model headphone set is equipped with a &quot;super powerful&quot; 30mm audio driver for crystal clear sound. The <strong>Skullcandy iCon</strong> headphones include additional features such as a 45 gram total weight, interchangable caps adorned with special Skullcandy designs for alternate color options, a 1.2M cord with a 3.5mm stereo plug, and Ferrite Magnets. The headphone set is also available in several different color patterns such as Black and Yellow, Chrome, Metal and Red, or Mix.</p>\n<h2>&nbsp;Features</h2>\n<ul>\n    <li>Over the head headband design with Closed/rest on ear speaker design</li>\n    <li>Custom built double headband</li>\n    <li>45 grams total weight</li>\n    <li>Interchangable caps adorned with Skullcandy graphics included</li>\n    <li>1.2M cord with a 3.5mm stereo plug</li>\n    <li>Available in several different color sets; Black and Yellow, Chrome, Metal and Red, and Mixed</li>\n    <li>Driver Unit Diameter: 30mm</li>\n    <li>Magnet: Ferrite</li>\n    <li>Frequency Response: 20Hz-20,000Hz</li>\n    <li>Power Handling Capacity: 100mW</li>\n    <li>Includes Skullcandy Lifetime Warranty</li>\n</ul>","proscore":"86","number_of_reviews":"1","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"comfortable fit, doesn't squeeze the ears too much","id":null,"score":null,"submitter":false},{"text":"rests securely on the head, can be worn outdoors while engaging in light activities","id":null,"score":null,"submitter":false},{"text":"compact design is easy to transport and store","id":null,"score":null,"submitter":false},{"text":"built with durable components, can take a few drops","id":null,"score":null,"submitter":false},{"text":"audio quality is very clear, details in the sound stand out without needing loud volume","id":null,"score":null,"submitter":false},{"text":"bass support is very strong, capable of thumping sound","id":null,"score":null,"submitter":false}],"cons":[{"text":"highs can get tinny, with some distortion in the mids - not severe but its there","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/skullcandy-lowrider/","id":22071,"title":"Skullcandy Lowrider","description":"<p>The <strong>Skullcandy Lowrider</strong> model is a low end headphone set designed with a lightweight structure for use during many different occasions; it is suitable for casual in home/business and travel use. The fully adjustable and reinforced headband ensures a firm fit for users of all ages. The <span style=\"font-weight: bold;\">Lowrider</span> model headphone set is equipped with a pair of large size 40mm diameter driver units for enhanced sound. The <strong>Skullcandy Lowrider</strong> headphones include additional features such as a max input power of 400mW, a 1.2M cord with a 3.5mm gold plated stereo plug for maximum conductivity, and rare earth Neodymium Ferrite Magnets. The headphone set is also available in a plethora of different color sets such as Pink, Black, Native Black, Black-Gold, Black-Silver, Blue, Chrome-Blue, Chrome-Yellow, Green, Lime-Black, Metallic Red, Native Brown, Native Turqiouse, Purple, Red-White, Silver-Black, Silver-Red, Silver and White-Gold.</p>\n<h2>Features</h2>\n<ul>\n    <li>Over the head headband design with Closed/rest on ear speaker design</li>\n    <li>Fully adjustable, reinforced headband</li>\n    <li>1.2M cord with a 3.5mm gold plated stereo plug</li>\n    <li>Available in many different color sets; Pink, Black, Native Black, Black-Gold, Black-Silver, Blue, Chrome-Blue, Chrome-Yellow, Green, Lime-Black, Metallic Red, Native Brown, Native Turqiouse, Purple, Red-White, Silver-Black, Silver-Red, Silver and White-Gold</li>\n    <li>Driver Unit Diameter: 40mm</li>\n    <li>Magnet: Neodymium Ferrite</li>\n    <li>Frequency Response: 100 - 18,000 HZ</li>\n    <li>Impedance: 32 ohms</li>\n    <li>Max input power: 400 mW</li>\n    <li>Includes Skullcandy Lifetime Warranty</li>\n</ul>","proscore":"75","number_of_reviews":"2","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"portable","id":null,"score":null,"submitter":false},{"text":"good bass","id":null,"score":null,"submitter":false}],"cons":[{"text":"break easily","id":null,"score":null,"submitter":false},{"text":"break easily, poor quality","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/skullcandy-mfm-pro/","id":22066,"title":"Skullcandy MFM Pro","description":"<p>The <strong>Skullcandy MFM Pro</strong> model is a high end headphone set designed with a closed-ear body and ear port structure. It is targeted for users of all ages who are constantly on the go, but it can also be used casually for home and business. Skullcandy claims the <strong>MFM Pro </strong>headphones are so unique that Marc Frank Montoya (pro snowboarder) selected the model as the single hottest Skullcandy product on the market. The <strong>MFM Pro</strong> headphones include large size 40mm diameter driver units, designed specifically to give crystal clear highs and booming lows; Skullcandy claims they are &quot;power drivers&quot;. The headphones also feature a very innovative, integrated and fully detachable 1 GB flash memory MP3 player; which allows users to directly play music on the headset eliminating the dependency on multiple media devices. The MP3 player slides directly into place on the headset and also eliminates the need for wires. The bundle comes with an optional battery pack for the MP3 player so it may be removed from the headset and used as a standard media device with any pair of headphones. The <strong>MFM Pro</strong> headphone set includes additional features such as direct USB upload/download to the MP3 player, DJ style headset design with 90 degree swivel speakers, an auxiliary audio jack with a detachable connection cable, and an LCD display complete with a backlight on the MP3 player. The <strong>Skullcandy MFM Pro</strong> actually has no set release date as of yet.</p>\n<h2>Features</h2>\n<ul>\n    <li>Closed-ear ear port structure</li>\n    <li>DJ Style headband design with 90 degree swivel speakers</li>\n    <li>Built-in 1GB flash memory MP3 player; MP3 player features an LCD display with a backlight</li>\n    <li>Bundle includes optional battery pack for MP3 player so it can be used without the headphones</li>\n    <li>USB direct upload/download for the MP3 player</li>\n    <li>Auxiliary port with fully detachable connection cable</li>\n    <li>Driver Unit Diameter: 40mm</li>\n</ul>","proscore":"86","number_of_reviews":"1","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"top band is very cushy and comfortable","id":null,"score":null,"submitter":false},{"text":"blocks out surrounding sound enough to prevent interferrence","id":null,"score":null,"submitter":false},{"text":"tracks load onto the MP3 player with a quick drag/drop action, very easy","id":null,"score":null,"submitter":false},{"text":"easy to switch tracks on the MP3 player on the fly","id":null,"score":null,"submitter":false},{"text":"ear cups rotate for a snug, comfortable fit that covers the ears without pressing too hard","id":null,"score":null,"submitter":false},{"text":"bass range very well represented, will rattle your teeth","id":null,"score":null,"submitter":false}],"cons":[{"text":"big and bulky, a bit awkward to wear outdoors","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/skullcandy-recruit/","id":22073,"title":"Skullcandy Recruit","description":"<p>The <strong>Skullcandy Recruit</strong> model is a low end sports headphone set designed with a lightweight structure for use during travel and on-the-go occasions. The <span style=\"font-weight: bold;\">Recruit</span> model is directly related to the <strong>Skullcandy iCon</strong> headphone model and is nearly identical. The specially designed and custom built double headband ensures a firm fit for users of all ages. The <strong>iCon</strong> model headphone set is equipped with a &quot;super powerful&quot; 30mm audio driver for crystal clear sound. The <strong>Skullcandy Recruit</strong> headphones include additional features such as a 45 gram total weight, interchangable caps adorned with special Skullcandy designs for alternate color options, a 1.2M cord with a 3.5mm stereo plug, and Ferrite Magnets. The headphone set is also available in several different color patterns such as Black and Yellow, Chrome, Metal and Red, or Mix.</p>\n<h2>Features</h2>\n<ul>\n    <li>Over the head headband design with Closed/rest on ear speaker design</li>\n    <li>Custom built double headband</li>\n    <li>45 grams total weight</li>\n    <li>Interchangable caps adorned with Skullcandy graphics included</li>\n    <li>1.2M cord with a 3.5mm stereo plug</li>\n    <li>Available in several different color sets; Black and Yellow, Chrome, Metal and Red, and Mixed</li>\n    <li>Driver Unit Diameter: 30mm</li>\n    <li>Magnet: Ferrite</li>\n    <li>Frequency Response: 20Hz-20,000Hz</li>\n    <li>Power Handling Capacity: 100mW</li>\n    <li>Includes Skullcandy Lifetime Warranty</li>\n</ul>","proscore":"-1","number_of_reviews":"0","category":null,"key_features":[],"images":[],"proscons":null,"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/skullcandy-sk-pro/","id":22097,"title":"Skullcandy SK Pro","description":"<p>The <strong>Skullcandy SK Pro</strong> model is a high-end headphone set designed with a thick, yet portable structure for use during many different occasions; it is suitable for casual in home/business and travel use. The ear cups are built with a closed ear design and are wrapped in soft leather touch padding; the ear cups also allow 90 degree swivel functionality for studio monitoring. The headband is wrapped in a soft leather touch pad for maximum comfort and is fully adjustable to ensure a firm fit for users of all ages. The <span style=\"font-weight: bold;\">SK Pro</span> model headphone set is equipped with a pair of very large size 50mm diameter &quot;power&quot; driver units for enhanced bass and 50mm speakers for excellent treble. The <strong>Skullcandy SK Pro</strong> headphones include additional features such as a 3.92M cord with a 3.5mm gold plated stereo plug for maximum conductivity, a pro coil cord, a 6.3mm screw-on stereo adapter, a travel bag, and a maximum power input of 100mW. The headphone set is also available in three different colors; Black, Red, and Yellow. </p>\n<h2>Features</h2>\n<ul>\n    <li>Over the head headband design with Closed/rest on ear cup design</li>\n    <li>Ear cups wrapped in soft leather touch padding</li>\n    <li>90 degree swivel ear cups for studio monitoring</li>\n    <li>Headband wrapped in soft leather touch padding </li>\n    <li>Fully adjustable headband</li>\n    <li>Pro Coil cord</li>\n    <li>6.3mm screw-on stereo adapter</li>\n    <li>Includes a travel bag</li>\n    <li>3.92M cord with a 3.5mm gold plated stereo plug</li>\n    <li>Available in three different colors; Black, Red, and Yellow</li>\n    <li>Driver Unit Diameter: 50mm</li>\n    <li>Speaker Size: 50mm</li>\n    <li>Magnet Type: NdFeB (Neodymium Ferrite)</li>\n    <li>Frequency range: 20Hz - 20Khz</li>\n    <li>Impedance: 64 ohms Max input</li>\n    <li>power / 100mW</li>\n</ul>","proscore":"-1","number_of_reviews":"0","category":null,"key_features":[],"images":[],"proscons":null,"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/skullcandy-skullcrushers/","id":22075,"title":"Skullcandy Skullcrushers","description":"<p>The <strong>Skullcandy Skullcrushers</strong> model is a mid-grade headphone set designed with a lightweight and portable structure for use during many different occasions; it is suitable for casual in home/business and travel use. The fully adjustable headband ensures a firm fit for users of all ages. The <span style=\"font-weight: bold;\">Skullcrushers</span> model headphone set is equipped with a pair of large size 30mm diameter driver units with vibration support that is combined with 30mm Neodymium magnets for enhanced bass; Skullcandy claims the headphones deliver so much bass that carrying this particular headset is like &quot;taking the club with you on the road&quot;. The <strong>Skullcandy Skullcrushers</strong> headphones include additional features such as an in-line vibration level adjustment and on/off switch, a 1.5M cord with a 3.5mm gold plated stereo plug for maximum conductivity, a 6.3mm plug adapter, and a vibration frequency of 100hz. The headphone set is also available in various different color sets such as Black-Checker, Black-Pinstripe, Blue, and Gold-Red. The<strong> Skullcrushers</strong> model headphone set is also available in a special multimedia edition for $10 more that is adorned in a glossy black finish and includes a built in headset microphone.</p>\n<h2>Features</h2>\n<ul>\n    <li>Over the head headband design with Closed/rest on ear speaker design</li>\n    <li>Fully adjustable headband</li>\n    <li>Large size driver units include enhanced vibration support for incredible bass</li>\n    <li>In-line level adjustment and on/off switch</li>\n    <li>6.3mm adapter included</li>\n    <li>1.5M cord with a 3.5mm gold plated stereo plug</li>\n    <li>Available in many different colors; Black-Checker, Black-Pinstripe, Blue, and Gold-Red</li>\n    <li>Driver Unit Diameter: 30mm</li>\n    <li>Magnet: Neodymium (30mm)</li>\n    <li>Vibration unit: 100hz</li>\n    <li>Frequency response: 20-20K Hz</li>\n    <li>Impedance: 32ohm</li>\n    <li>Sensitivity: 99db</li>\n</ul>\n<p>There is also a special multimedia edition available for $79.95 that includes glossy finish and a built in headset microphone.</p>\n<p>&nbsp;</p>","proscore":"93","number_of_reviews":"5","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"great sound quality, amazing bass, fold into a small size, sturdy","id":null,"score":null,"submitter":false},{"text":"comes with a carrying case","id":null,"score":null,"submitter":false},{"text":"high quality","id":null,"score":null,"submitter":false},{"text":"made by skullcandy","id":null,"score":null,"submitter":false},{"text":"bass control","id":null,"score":null,"submitter":false}],"cons":[{"text":"tight on your head, make your ears feel confined","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null},{"url":"http://www.productwiki.com/skullcandy-t-i/","id":22098,"title":"Skullcandy T.I.","description":"<p>The <strong>Skullcandy T.I.</strong> model is a mid-grade headphone set designed with a thick, yet portable structure for use during many different occasions; it is suitable for casual in home/business and travel use. The fully adjustable headband ensures a firm fit for users of all ages. The <span style=\"font-weight: bold;\">T.I.</span> model headphone set is equipped with a pair of durable 40mm titanium speakers for enhanced sound quality. The biggest feature the <strong>T.I.</strong> headphone set sports is the unique graphic designs and custom detailing surrounding the entire body; the headband is even laced with shaggy fur for enhanced comfort. The <strong>Skullcandy T.I.</strong> headphones include additional features such as a 1.2M cord with a 3.5mm gold plated stereo plug for maximum conductivity, included interchangeable ear pads, a travel bag, a 6.3mm gold plated stereo adapter, and a maximum power input of 400mW. The headphone set is also available in several different color patterns such as Black-Fur, Brown-Gold, Gold-Foil-Rasta, Patent-Green-Yellow, Pink-Fur, and White-Fur.</p>\n<h2>&nbsp;Features</h2>\n<ul>\n    <li>Over the head headband design with Closed/rest on ear speaker design</li>\n    <li>Fully adjustable headband</li>\n    <li>Unique custom graphic designs and body detailing</li>\n    <li>Includes a travel bag, interchangeable ear pads, and a 6.3mm gold plated stereo adapter</li>\n    <li>1.2M cord with a 3.5mm gold plated stereo plug</li>\n    <li>Available in many different colors; Black-Fur, Brown-Gold, Gold-Foil-Rasta, Patent-Green-Yellow, Pink-Fur, and White-Fur</li>\n    <li>Speaker Size: 40mm Titanium</li>\n    <li>Frequency range: 100 &ndash; 18,000 Hz</li>\n    <li>Impedance: 32/50 ohms</li>\n    <li>Max input power: 400mW</li>\n</ul>","proscore":"50","number_of_reviews":"2","category":null,"key_features":[],"images":[],"proscons":{"pros":[{"text":"Inexpensive for this style of headphone","id":null,"score":null,"submitter":false},{"text":"Stylish design, several different options available","id":null,"score":null,"submitter":false},{"text":"Comfortable earcup design","id":null,"score":null,"submitter":false},{"text":"Overall, clear sound quality","id":null,"score":null,"submitter":false}],"cons":[{"text":"Bass is weak compared to hi- and mid-frequencies","id":null,"score":null,"submitter":false},{"text":"Lacks a range of adjustment for different head sizes","id":null,"score":null,"submitter":false},{"text":"Plastic earcup supports may weaken or break over time","id":null,"score":null,"submitter":false}]},"reviews":null,"tags":null,"competitors":null,"related":null,"skus":null}],"skus":[{"title":"Skullcandy G.I. Stereo Headphones S6GICZ-058 (Rasta)","upc":"878615011748","mpn":"S6GICZ-058","asin":"B003KE3SJI","ean":"878615011748"},{"title":"Skullcandy G.I. - Winter Camo","upc":null,"mpn":null,"asin":"B002C8L53Y","ean":null},{"title":"Skullcandy G.I. Headphones Gridlock, One Size","upc":"878615012448","mpn":"25527","asin":"B0040Q7XF0","ean":"878615012448"},{"title":"Skullcandy G.I. - Winter Camo","upc":null,"mpn":null,"asin":"B001EQQBQG","ean":null},{"title":"Skullcandy G.I. - Green","upc":"878615001992","mpn":"CH32SKC48","asin":"B001DMAAQI","ean":"878615001992"},{"title":"Skullcandy G.I. - Rasta","upc":null,"mpn":null,"asin":"B001DM6QJI","ean":null},{"title":"Skullcandy G.I. - Gray","upc":"878615002005","mpn":"CH32SKC49","asin":"B001DM6QI4","ean":"878615002005"},{"title":"Skullcandy G.I. - Black Camo","upc":null,"mpn":null,"asin":"B002C8NWGW","ean":null},{"title":"Skullcandy G.I. Stereo Headphones S6GICZ-003 (Black)","upc":"878615011717","mpn":"S6GICZ003","asin":"B003KE8THO","ean":"878615011717"},{"title":"Skullcandy (Product Out Of Date, Newer Version Available) GI PS3 Gaming Headphone with Boom Mic S6GIB3-BR (Black/Red)","upc":"878615008427","mpn":"S6GIB3-BR","asin":"B003C34WDI","ean":"878615008427"},{"title":"Skullcandy G.I. - Camo","upc":"878615000575","mpn":"HF88SKC15","asin":"B000W3NJW6","ean":"878615000575"},{"title":"Skullcandy G.I. - Red","upc":"878615002074","mpn":"HF88SKC11","asin":"B0019OBGPY","ean":"878615002074"},{"title":"Skullcandy G.I. - Winter Camo","upc":"878615000568","mpn":"HF88SKC18","asin":"B000W3JH1S","ean":"878615000568"},{"title":"Skullcandy G.I. - Desert Camo","upc":null,"mpn":null,"asin":"B0019OEZ6G","ean":null},{"title":"Skullcandy G.I. - Desert Camo","upc":null,"mpn":"SCDGI","asin":"B002C8PPT4","ean":null},{"title":"Skullcandy S6GIBZ-23 G.I. Headphones (Black Print)","upc":"878615003996","mpn":"S6GIBZ-23","asin":"B0023RRNBW","ean":"878615003996"}]}]}